Server/app/Controllers/Movies.php

   public function index()
   {
        $data = $this->model->orderBy('id_movie', 'ASC')->findAll();
---
SELECT *
FROM `tbl_movie`
ORDER BY `id_movie` ASC

   public function show($id = null)
   {
        $data = $this->model->where("id_movie", $id)->findAll();
---
SELECT *
FROM `tbl_movie`
WHERE `id_movie` = '19'

   public function update($id = null)
   {
        $data = $this->request->getRawInput();
        $data['id_movie'] = $id;

        $isExist = $this->model->where('id_movie', $id)->findAll();
---
SELECT *
FROM `tbl_movie`
WHERE `id_movie` = '19'

   public function delete($id = null)
   {
        $data = $this->model->where('id_movie', $id)->findAll();
        if($data) {
            $this->model->delete($id);
---
SELECT *
FROM `tbl_movie`
WHERE `id_movie` = '100'
DELETE FROM `tbl_movie`
WHERE `id_movie` IN ('13')