Client/app/Models/ModelToken.php

    function getToken($id) {
        $builder = $this->table('token');
        $data = $builder->where('id', $id)->first();
---
SELECT *
FROM `token`
WHERE `id` = '1'
 LIMIT 1