Server/app/Models/ModelOtentikasi.php

    function getEmail($email)
    {
        $builder = $this->table("otentikasi");
        $data = $builder->where("email", $email)->first();
---
SELECT *
FROM `otentikasi`
WHERE `email` = 'raihan@gmail.com'
 LIMIT 1